# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
n = int(input("Введите число N: "))
x = 2
i = 1
print("Степени двойки: ", end=" ")
while x < n:
    x = 2 ** i
    i += 1
    if x <= n:
        print(f"{x}", end=", ")
